performance/reports/archive/runs/normal-day-2026-08-16T10-24-54/summary.txt
     ✓ login 200
     ✓ chat rooms 200
     ✓ post create 2xx
     ✓ board list 200
     ✓ chat messages 200
     ✓ chat read 200
     ✓ hot daily 200
     ✓ post list 200
     ✓ post detail 200
     ✓ comment list 200
     ✓ unread count 200
     ✓ post search 200
     ✓ notif list 200
     ✓ read one 200
     ✓ meal today 200
     ✓ comment reaction 200
     ✓ timetable today 200
     ✓ comment create 2xx
     ✓ post reaction 2xx
     ✓ ws handshake 101
     ✓ user info 200
     ✓ my posts 200
     ✓ refresh 200
     ✓ friend list 200
     ✓ received reqs 200
     ✓ scrap 2xx
     ✓ read all 200
     ✓ logout 200
     ✓ post update 200
     ✓ post delete 200
     ✓ meal month 200

     auth_token_refreshes...........: 90      0.055058/s
     chat_ws_messages_sent..........: 2225    1.361146/s
     chat_ws_rtt....................: avg=2.92s   min=16ms    med=2.53s    max=15.97s   p(90)=5.92s   p(95)=7.37s    p(99)=10.44s  
     checks.........................: 100.00% ✓ 37837     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 28883     ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 2276      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 6678      ✗ 0    
     data_received..................: 1.7 GB  1.0 MB/s
     data_sent......................: 15 MB   9.4 kB/s
     http_req_blocked...............: avg=14.24µs min=1.03µs  med=5.33µs   max=27.38ms  p(90)=13.46µs p(95)=16.56µs  p(99)=228.81µs
     http_req_connecting............: avg=5.64µs  min=0s      med=0s       max=27.32ms  p(90)=0s      p(95)=0s       p(99)=151.25µs
     http_req_duration..............: avg=5.33s   min=2.33ms  med=4.93s    max=27.78s   p(90)=9.79s   p(95)=11.7s    p(99)=16.88s  
       { expected_response:true }...: avg=5.33s   min=2.33ms  med=4.93s    max=27.78s   p(90)=9.79s   p(95)=11.7s    p(99)=16.88s  
     ✓ { feature:auth }.............: avg=3.12s   min=14.75ms med=2.29s    max=18.12s   p(90)=7.27s   p(95)=9.1s     p(99)=11.75s  
     ✓ { feature:board }............: avg=5.13s   min=2.63ms  med=4.85s    max=20.36s   p(90)=9.22s   p(95)=10.98s   p(99)=14.65s  
     ✓ { feature:chat }.............: avg=5.22s   min=3.31ms  med=5s       max=20.12s   p(90)=9.37s   p(95)=10.96s   p(99)=13.74s  
     ✓ { feature:comment }..........: avg=6.68s   min=2.42ms  med=5.92s    max=27.78s   p(90)=13.1s   p(95)=15.81s   p(99)=19.89s  
     ✓ { feature:friend }...........: avg=5.32s   min=3.04ms  med=5s       max=22.77s   p(90)=9.82s   p(95)=11.37s   p(99)=15.17s  
     ✓ { feature:hot }..............: avg=5.38s   min=8.13ms  med=5.23s    max=20.44s   p(90)=9.46s   p(95)=11.11s   p(99)=14.3s   
     ✓ { feature:mypage }...........: avg=4.93s   min=2.71ms  med=4.67s    max=18.04s   p(90)=9.11s   p(95)=10.67s   p(99)=12.51s  
     ✓ { feature:notification }.....: avg=5.26s   min=2.89ms  med=5.03s    max=20.08s   p(90)=9.45s   p(95)=10.86s   p(99)=13.9s   
     ✓ { feature:post }.............: avg=4.89s   min=2.33ms  med=4.56s    max=22.01s   p(90)=9.01s   p(95)=10.63s   p(99)=14.09s  
     ✓ { feature:reaction }.........: avg=5.22s   min=18.21ms med=5.14s    max=18.92s   p(90)=9.41s   p(95)=10.54s   p(99)=13.67s  
     ✓ { feature:school }...........: avg=5.11s   min=2.89ms  med=4.96s    max=15.95s   p(90)=8.82s   p(95)=10.3s    p(99)=14.64s  
     ✓ { feature:scrap }............: avg=5.48s   min=16.49ms med=5.25s    max=20.59s   p(90)=9.11s   p(95)=10.74s   p(99)=18.43s  
     ✓ { feature:timetable }........: avg=5.22s   min=2.77ms  med=4.81s    max=18.92s   p(90)=9.15s   p(95)=10.68s   p(99)=12.08s  
     ✓ { op:auth }..................: avg=3.12s   min=14.75ms med=2.29s    max=18.12s   p(90)=7.27s   p(95)=9.1s     p(99)=11.75s  
     ✗ { op:read,phase:measure }....: avg=6.06s   min=2.33ms  med=5.53s    max=27.39s   p(90)=10.23s  p(95)=12.18s   p(99)=17.42s  
     ✗ { op:write,phase:measure }...: avg=6.48s   min=2.97ms  med=5.96s    max=27.78s   p(90)=10.66s  p(95)=12.02s   p(99)=16.2s   
     ✓ { page:0 }...................: avg=3.72s   min=2.37ms  med=3.25s    max=22.01s   p(90)=7.36s   p(95)=8.85s    p(99)=12.6s   
     ✓ { page:1 }...................: avg=3.7s    min=2.57ms  med=3.15s    max=19.83s   p(90)=7.58s   p(95)=9.37s    p(99)=13.35s  
     ✓ { page:2 }...................: avg=3.78s   min=2.33ms  med=3.24s    max=19.62s   p(90)=7.47s   p(95)=8.68s    p(99)=13.5s   
     ✓ { page:3 }...................: avg=3.87s   min=3.08ms  med=3.36s    max=19.74s   p(90)=7.51s   p(95)=9.03s    p(99)=12.95s  
     ✓ { page:4 }...................: avg=4.35s   min=2.92ms  med=3.69s    max=14.66s   p(90)=8.21s   p(95)=10.37s   p(99)=13.18s  
     ✓ { phase:measure }............: avg=6.09s   min=2.33ms  med=5.57s    max=27.78s   p(90)=10.29s  p(95)=12.16s   p(99)=17.4s   
     ✓ { phase:rampdown }...........: avg=4.7s    min=2.42ms  med=3.85s    max=21.4s    p(90)=10.23s  p(95)=11.35s   p(99)=14.95s  
     ✓ { phase:warmup }.............: avg=2.26s   min=2.37ms  med=1.21s    max=23.66s   p(90)=6.13s   p(95)=7.68s    p(99)=12.47s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 37434
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 28651
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 2074 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 6709 
     http_req_receiving.............: avg=1.44ms  min=15.28µs med=189.97µs max=225.95ms p(90)=951.9µs p(95)=3ms      p(99)=52.61ms 
     http_req_sending...............: avg=48.91µs min=4.11µs  med=28.64µs  max=207.83ms p(90)=83.47µs p(95)=109.14µs p(99)=196.95µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=5.33s   min=2.22ms  med=4.93s    max=27.78s   p(90)=9.79s   p(95)=11.7s    p(99)=16.86s  
     http_reqs......................: 37434   22.900286/s
     ✓ { feature:auth }.............: 444     0.271617/s
     ✓ { feature:board }............: 3493    2.136846/s
     ✓ { feature:chat }.............: 2885    1.764902/s
     ✓ { feature:comment }..........: 6890    4.214964/s
     ✓ { feature:friend }...........: 578     0.353592/s
     ✓ { feature:hot }..............: 3493    2.136846/s
     ✓ { feature:mypage }...........: 522     0.319334/s
     ✓ { feature:notification }.....: 1500    0.917626/s
     ✓ { feature:post }.............: 16171   9.892625/s
     ✓ { feature:reaction }.........: 695     0.425167/s
     ✓ { feature:school }...........: 308     0.188419/s
     ✓ { feature:scrap }............: 208     0.127244/s
     ✓ { feature:timetable }........: 247     0.151102/s
     ✓ { op:auth }..................: 444     0.271617/s
     ✓ { op:read }..................: 34179   20.909036/s
     ✓ { op:write }.................: 2811    1.719632/s
     ✓ { page:0 }...................: 1932    1.181903/s
     ✓ { page:1 }...................: 689     0.421496/s
     ✓ { page:2 }...................: 432     0.264276/s
     ✓ { page:3 }...................: 286     0.174961/s
     ✓ { page:4 }...................: 154     0.09421/s
     ✓ { phase:measure }............: 28651   17.527277/s
     ✓ { phase:rampdown }...........: 2074    1.268772/s
     ✓ { phase:warmup }.............: 6709    4.104237/s
     iteration_duration.............: avg=32.64s  min=1.04s   med=23.67s   max=1m54s    p(90)=1m9s    p(95)=1m18s    p(99)=1m32s   
     iterations.....................: 8678    5.308775/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 8678    5.308775/s
     ✓ { phase:measure }............: 6669    4.079767/s
     ✓ { phase:rampdown }...........: 527     0.322393/s
     ✓ { phase:warmup }.............: 1482    0.906615/s
     vus............................: 2       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=4.38s   min=2.69ms  med=4.1s     max=17.28s   p(90)=8.38s   p(95)=9.77s    p(99)=12.89s  
     ws_msgs_received...............: 2291    1.401521/s
     ws_msgs_sent...................: 3031    1.854217/s
     ws_session_duration............: avg=26.78s  min=15.56s  med=26.23s   max=41.92s   p(90)=33.9s   p(95)=36.07s   p(99)=39.78s  
     ws_sessions....................: 403     0.246536/s